IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM18_CONTROLSS_G3_EPWM18.xml
	<register id="CONTROLSS_G3_EPWM18_EPWMSYNCOUTEN" acronym="CONTROLSS_G3_EPWM18_EPWMSYNCOUTEN" offset="0xC" width="16" description="EPWMxSYNCOUT Source Enable Register">
		<bitfield id="DCBEVT1EN" width="1" begin="6" end="6" resetval="0x0" description="This bit enables the DCBEVT1.sync event to set the EPWMxSYNCO signal.   0  Disabled   1  The EPWMxSYNCO signal is pulsed for one PWM clock period upon a DCBEVT1.sync event" range="6" rwaccess="R/W"/> 
		<bitfield id="DCAEVT1EN" width="1" begin="5" end="5" resetval="0x0" description="This bit enables the DCAEVT1.sync event to set the EPWMxSYNCOUT signal.   0  Disabled   1  The EPWMxSYNCOUT signal is pulsed for one PWM clock period upon a DCAEVT1.sync event" range="5" rwaccess="R/W"/> 
		<bitfield id="CMPDEN" width="1" begin="4" end="4" resetval="0x0" description="This bit enables the TBCTR = CMPD event to set the EPWMxSYNCO signal.   0  Disabled   1  The EPWMxSYNCO signal is pulsed for one PWM clock period upon a time-base counter equal to counter compare D event [TBCTR = CMPD]" range="4" rwaccess="R/W"/> 
		<bitfield id="CMPCEN" width="1" begin="3" end="3" resetval="0x0" description="This bit enables the TBCTR = CMPC event to set the EPWMxSYNCO signal.   0  Disabled   1  The EPWMxSYNCO signal is pulsed for one PWM clock period upon a time-base counter equal to counter compare C event [TBCTR = CMPC]" range="3" rwaccess="R/W"/> 
		<bitfield id="CMPBEN" width="1" begin="2" end="2" resetval="0x0" description="This bit enables the TBCTR = CMPB event to set the EPWMxSYNCO signal.   0  Disabled   1  The EPWMxSYNCO signal is pulsed for one PWM clock period upon a time-base counter equal to counter compare B event [TBCTR = CMPB]" range="2" rwaccess="R/W"/> 
		<bitfield id="ZEROEN" width="1" begin="1" end="1" resetval="0x0" description="This bit enables the TBCTR = 0x0000 event to set the EPWMxSYNCOUT signal.   0  Disabled   1  The EPWMxSYNCOUT signal is pulsed for one PWM clock period upon the value of TBCTR changing to 0x0000" range="1" rwaccess="R/W"/> 
		<bitfield id="SWEN" width="1" begin="0" end="0" resetval="0x1" description="This bit enables the TBCTL.SWFSYNC bit to set the EPWMxSYNCO signal.   0  Disabled   1  The EPWMxSYNCO signal is pulsed for one PWM clock period when the TBCTL.SWFSYNC bit is set" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM18_TBCTL3" acronym="CONTROLSS_G3_EPWM18_TBCTL3" offset="0xE" width="16" description="Time Base Control Register 3">
		<bitfield id="OSSFRCEN" width="1" begin="0" end="0" resetval="0x0" description="This bit determines which bit sets the EPWMxSYNCOUT One Shot Latch.   0  TBCTL2[OSHTSYNC] sets the One Shot Latch   1  GLDCTL2[OSHTLD] sets the One Shot Latch" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM18_CMPCTL" acronym="CONTROLSS_G3_EPWM18_CMPCTL" offset="0x10" width="16" description="Counter Compare Control Register">
		<bitfield id="LINKDUTYHR" width="1" begin="15" end="15" resetval="0x0" description="CMPAHR, CMPBHR Register Linking:  0 PWMA and PWMB outputs generated independently and CMPAHR, CMPBHR are independent values as on Type-4 1 When this bit is set CMPBHR assumes the same value as CMPAHR. This is typically used in complimentary PWM output generation    [Section 7 details of the operation]" range="15" rwaccess="R/W"/> 
		<bitfield id="LOADBSYNC" width="2" begin="13" end="12" resetval="0x0" description="Shadow to Active CMPB Register Load on SYNC event   00: Shadow to Active Load of CMPB:CMPBHR occurs according to LOADBMODE [bits 1,0] [same as legacy]  01: Shadow to Active Load of CMPB:CMPBHR occurs both according to LOADBMODE bits and when SYNC occurs  10: Shadow to Active Load of CMPB:CMPBHR occurs only when a SYNC is received  11: Reserved  Note: This bit is valid only if CMPCTL[SHDWBMODE] = 0." range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="LOADASYNC" width="2" begin="11" end="10" resetval="0x0" description="Shadow to Active CMPA Register Load on SYNC event   00: Shadow to Active Load of CMPA:CMPAHR occurs according to LOADAMODE [bits 1,0] [same as legacy]  01: Shadow to Active Load of CMPA:CMPAHR occurs both according to LOADAMODE bits and when SYNC occurs  10: Shadow to Active Load of CMPA:CMPAHR occurs only when a SYNC is received  11: Reserved  Note: This bit is valid only if CMPCTL[SHDWAMODE] = 0." range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="SHDWBFULL" width="1" begin="9" end="9" resetval="0x0" description="Counter-compare B [CMPB] Shadow Register Full Status Flag  This bit self clears once a loadstrobe occurs.   0: CMPB shadow FIFO not full yet  1: Indicates the CMPB shadow FIFO is full  a CPU write will overwrite current shadow value" range="9" rwaccess="R"/> 
		<bitfield id="SHDWAFULL" width="1" begin="8" end="8" resetval="0x0" description="Counter-compare A [CMPA] Shadow Register Full Status Flag  The flag bit is set when a 32-bit write to CMPA:CMPAHR register or a 16-bit write to CMPA register is made. A 16-bit write to CMPAHR register will not affect the flag. This bit self clears once a load-strobe occurs.   0: CMPA shadow FIFO not full yet  1: Indicates the CMPA shadow FIFO is full, a CPU write will overwrite the current shadow value" range="8" rwaccess="R"/> 
		<bitfield id="SHDWBMODE" width="1" begin="6" end="6" resetval="0x0" description="Counter-compare B [CMPB] Register Operating Mode   0: Shadow mode. Operates as a double buffer. All writes via the CPU access the shadow register  1: Immediate mode. Only the active compare B register is used. All writes and reads directly access the active register for immediate compare action" range="6" rwaccess="R/W"/> 
		<bitfield id="SHDWAMODE" width="1" begin="4" end="4" resetval="0x0" description="Counter-compare A [CMPA] Register Operating Mode   0: Shadow mode. Operates as a double buffer. All writes via the CPU access the shadow register  1: Immediate mode. Only the active compare register is used. All writes and reads directly access the active register for immediate compare action" range="4" rwaccess="R/W"/> 
		<bitfield id="LOADBMODE" width="2" begin="3" end="2" resetval="0x0" description="Active Counter-Compare B [CMPB] Load From Shadow Select Mode  This bit has no effect in immediate mode [CMPCTL[SHDWBMODE] = 1].   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="LOADAMODE" width="2" begin="1" end="0" resetval="0x0" description="Active Counter-Compare A [CMPA] Load From Shadow Select Mode  This bit has no effect in immediate mode [CMPCTL[SHDWAMODE] = 1].   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM18_CMPCTL2" acronym="CONTROLSS_G3_EPWM18_CMPCTL2" offset="0x12" width="16" description="Counter Compare Control Register 2">
		<bitfield id="LOADDSYNC" width="2" begin="13" end="12" resetval="0x0" description="Shadow to Active CMPD Register Load on SYNC event   00: Shadow to Active Load of CMPD occurs according to LOADDMODE  01: Shadow to Active Load of CMPD occurs both according to LOADDMODE bits and when SYNC occurs  10: Shadow to Active Load of CMPD occurs only when a SYNC is received  11: Reserved  Note: This bit is valid only if CMPCTL2[SHDWDMODE] = 0." range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="LOADCSYNC" width="2" begin="11" end="10" resetval="0x0" description="Shadow to Active CMPC Register Load on SYNC event   00: Shadow to Active Load of CMPC occurs according to LOADCMODE  01: Shadow to Active Load of CMPC occurs both according to LOADCMODE bits and when SYNC occurs  10: Shadow to Active Load of CMPC occurs only when a SYNC is received  11: Reserved  Note: This bit is valid only if CMPCTL2[SHDWCMODE] = 0." range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="SHDWDMODE" width="1" begin="6" end="6" resetval="0x0" description="Counter-Compare D Register Operating Mode   0: Shadow mode - operates as a double buffer. All writes via the CPU access Shadow register.  1: Immediate mode - only the Active compare register is used. All writes/reads via the CPU directly access the Active register for immediate Compare action." range="6" rwaccess="R/W"/> 
		<bitfield id="SHDWCMODE" width="1" begin="4" end="4" resetval="0x0" description="Counter-Compare C Register Operating Mode   0: Shadow mode - operates as a double buffer. All writes via the CPU access Shadow register.  1: Immediate mode - only the Active compare register is used. All writes/reads via the CPU directly access the Active register for immediate Compare action." range="4" rwaccess="R/W"/> 
		<bitfield id="LOADDMODE" width="2" begin="3" end="2" resetval="0x0" description="Active Counter-Compare D [CMPD] Load from Shadow Select Mode   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]  Note: Has no effect in Immediate mode." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="LOADCMODE" width="2" begin="1" end="0" resetval="0x0" description="Active Counter-Compare C [CMPC] Load from Shadow Select Mode   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]  Note: Has no effect in Immediate mode." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM18_DBCTL" acronym="CONTROLSS_G3_EPWM18_DBCTL" offset="0x18" width="16" description="Dead-Band Generator Control Register">
		<bitfield id="HALFCYCLE" width="1" begin="15" end="15" resetval="0x0" description="Half Cycle Clocking Enable Bit   0: Full cycle clocking enabled. The dead-band counters are clocked at the TBCLK rate.  1: Half cycle clocking enabled. The dead-band counters are clocked at TBCLK*2." range="15" rwaccess="R/W"/> 
		<bitfield id="DEDB_MODE" width="1" begin="14" end="14" resetval="0x0" description="Dead Band Dual-Edge B Mode Control [S8 switch]   0: Rising edge delay applied to InA/InB as selected by S4 switch [IN-MODE bits] on A signal path only. Falling edge delay applied to InA/InB as selected by S5 switch [INMODE bits] on B signal path only.  1: Rising edge delay and falling edge delay applied to source selected by S4 switch [INMODE bits] and output to B signal path only. Note: When this bit is set to 1, user should always either set OUT_MODE bits such that Apath = InA OR OUTSWAP bits such that OutA=Bpath  otherwise, OutA will be invalid." range="14" rwaccess="R/W"/> 
		<bitfield id="OUTSWAP" width="2" begin="13" end="12" resetval="0x0" description="Dead Band Output Swap Control  Bit 13 controls the S6 switch and bit 12 controls the S7 switch.   00: OutA and OutB signals are as defined by OUT-MODE bits.  01: OutA = A-path as defined by OUT-MODE bits.  OutB = A-path as defined by OUT-MODE bits [rising edge delay or delay-bypassed A signal path].  10: OutA = B-path as defined by OUT-MODE bits [falling edge delay or delay-bypassed B signal path].  OutB = B-path as defined by OUT-MODE bits.  11: OutA = B-path as defined by OUT-MODE bits [falling edge delay or delay-bypassed B signal path].  OutB = A-path as defined by OUT-MODE bits [rising edge delay or delay-bypassed A signal path]." range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="SHDWDBFEDMODE" width="1" begin="11" end="11" resetval="0x0" description="FED Dead-Band Load Mode   0: Immediate mode. Only the active DBFED register is used. All writes/reads via the CPU directly access the active register for immediate FED dead-band action.  1: Shadow mode. Operates as a double buffer. All writes via the CPU access Shadow register. Default at Reset is Immediate mode [for compatibility with legacy]." range="11" rwaccess="R/W"/> 
		<bitfield id="SHDWDBREDMODE" width="1" begin="10" end="10" resetval="0x0" description="RED Dead-Band Load Mode   0: Immediate mode. Only the active DBRED register is used. All writes/reads via the CPU directly access the active register for immediate RED dead-band action.  1: Shadow mode. Operates as a double buffer. All writes via the CPU access Shadow register. Default at Reset is Immediate mode [for compatibility with legacy]." range="10" rwaccess="R/W"/> 
		<bitfield id="LOADFEDMODE" width="2" begin="9" end="8" resetval="0x0" description="Active DBFED Load from Shadow Select Mode   00: Load on Counter = 0 [CNT_eq]  01: Load on Counter = Period [PRD_eq]  10: Load on either Counter = 0, or Counter = Period  11: Freeze [no loads possible]  Note: has no effect in Immediate mode." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="LOADREDMODE" width="2" begin="7" end="6" resetval="0x0" description="Active DBRED Load from Shadow Select Mode   00: Load on Counter = 0 [CNT_eq]  01: Load on Counter = Period [PRD_eq]  10: Load on either Counter = 0, or Counter = Period  11: Freeze [no loads possible]  Note: has no effect in Immediate mode." range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="IN_MODE" width="2" begin="5" end="4" resetval="0x0" description="Dead-Band Input Mode Control  Bit 5 controls the S5 switch and bit 4 controls the S4 switch shown. This allows you to select the input source to the falling-edge and rising-edge delay. To produce classical dead-band waveforms the default is EPWMxA In is the source for both falling and rising-edge delays.   00: EPWMxA In [from the action-qualifier] is the source for both falling-edge and rising-edge delay.  01: EPWMxB In [from the action-qualifier] is the source for rising-edge delayed signal.  EPWMxA In [from the action-qualifier] is the source for falling-edge delayed signal.  10: EPWMxA In [from the action-qualifier] is the source for rising-edge delayed signal.  EPWMxB In [from the action-qualifier] is the source for falling-edge delayed signal.  11: EPWMxB In [from the action-qualifier] is the source for both rising-edge delay and falling-edge delayed signal." range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="POLSEL" width="2" begin="3" end="2" resetval="0x0" description="Polarity Select Control  Bit 3 controls the S3 switch and bit 2 controls the S2 switch. This allows you to selectively invert one of the delayed signals before it is sent out of the dead-band submodule. The following descriptions correspond to classical upper/lower switch control as found in one leg of a digital motor control inverter. These assume that DBCTL[OUT_MODE] = 1,1 and DBCTL[IN_MODE] = 0x0. Other enhanced modes are also possible, but not regarded as typical usage modes.   00: Active high [AH] mode. Neither EPWMxA nor EPWMxB is inverted [default].  01: Active low complementary [ALC] mode. EPWMxA is inverted.  10: Active high complementary [AHC]. EPWMxB is inverted.  11: Active low [AL] mode. Both EPWMxA and EPWMxB are inverted." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="OUT_MODE" width="2" begin="1" end="0" resetval="0x0" description="Dead-Band Output Mode Control  Bit 1 controls the S1 switch and bit 0 controls the S0 switch.   00: DBM is fully disabled or by-passed. In this mode the POLSEL and IN-MODE bits have no effect.  01: Apath = InA [delay is by-passed for A signal path]  Bpath = FED [Falling Edge Delay in B signal path]  10: Apath = RED [Rising Edge Delay in A signal path]  Bpath = InB [delay is by-passed for B signal path]  11: DBM is fully enabled [i.e. both RED and FED active]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM18_DBCTL2" acronym="CONTROLSS_G3_EPWM18_DBCTL2" offset="0x1A" width="16" description="Dead-Band Generator Control Register 2">
		<bitfield id="SHDWDBCTLMODE" width="1" begin="2" end="2" resetval="0x0" description="DBCTL Load Mode   0: Immediate mode - only the Active DBCTL register is used. All writes/reads via the CPU directly access the Active register.  1: Shadow mode - All writes and reads to bits [5:0] of the DBCTL register are shadowed. All other bits still access the active register." range="2" rwaccess="R/W"/> 
		<bitfield id="LOADDBCTLMODE" width="2" begin="1" end="0" resetval="0x0" description="Active DBCTL Load from Shadow Select Mode   00: Load on Counter = 0 [CNT_eq]  01: Load on Counter = Period [PRD_eq]  10: Load on either Counter = 0, or Counter = Period  11: Freeze [no loads possible]  Note: has no effect in Immediate mode" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM18_AQCTL" acronym="CONTROLSS_G3_EPWM18_AQCTL" offset="0x20" width="16" description="Action Qualifier Control Register">
		<bitfield id="LDAQBSYNC" width="2" begin="11" end="10" resetval="0x0" description="Shadow to Active AQCTLB Register Load on SYNC event   00: Shadow to Active Load of AQCTLB occurs according to LDAQBMODE  01: Shadow to Active Load of AQCTLB occurs both according to LDAQBMODE bits and when SYNC occurs.  10: Shadow to Active Load of AQCTLB occurs only when a SYNC is received.  11: Reserved  Note: This bit is valid only if AQCTL[SHDWAQBMODE] = 1." range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="LDAQASYNC" width="2" begin="9" end="8" resetval="0x0" description="Shadow to Active AQCTLA Register Load on SYNC event   00: Shadow to Active Load of AQCTLA occurs according to LDAQAMODE  01: Shadow to Active Load of AQCTLA occurs both according to LDAQAMODE bits and when SYNC occurs.  10: Shadow to Active Load of AQCTLA occurs only when a SYNC is received.  11: Reserved  Note: This bit is valid only if AQCTL[SHDWAQAMODE] = 1." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SHDWAQBMODE" width="1" begin="6" end="6" resetval="0x0" description="Action Qualifier B Register operating mode   1: Shadow mode - operates as a double buffer. All writes via the CPU access Shadow register.  0: Immediate mode - only the Active action qualifier register is used. All writes/reads via the CPU directly access the Active register." range="6" rwaccess="R/W"/> 
		<bitfield id="SHDWAQAMODE" width="1" begin="4" end="4" resetval="0x0" description="Action Qualifier A Register operating mode   1: Shadow mode - operates as a double buffer. All writes via the CPU access Shadow register.  0: Immediate mode - only the Active action qualifier register is used. All writes/reads via the CPU directly access the Active register." range="4" rwaccess="R/W"/> 
		<bitfield id="LDAQBMODE" width="2" begin="3" end="2" resetval="0x0" description="Active Action Qualifier B Load from Shadow Select Mode   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]  Note: has no effect in Immediate mode." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="LDAQAMODE" width="2" begin="1" end="0" resetval="0x0" description="Active Action Qualifier A Load from Shadow Select Mode   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]  Note: has no effect in Immediate mode." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM18_AQTSRCSEL" acronym="CONTROLSS_G3_EPWM18_AQTSRCSEL" offset="0x22" width="16" description="Action Qualifier Trigger Event Source Select Register">
		<bitfield id="T2SEL" width="4" begin="7" end="4" resetval="0x0" description="T2 Event Source Select Bits   0000: DCAEVT1  0001: DCAEVT2  0010: DCBEVT1  0011: DCBEVT2  0100: TZ1  0101: TZ2  0110: TZ3  0111: EPWMxSYNCI  1000: DCEVTFILT  Others: Reserved" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="T1SEL" width="4" begin="3" end="0" resetval="0x0" description="T1 Event Source Select Bits   0000: DCAEVT1  0001: DCAEVT2  0010: DCBEVT1  0011: DCBEVT2  0100: TZ1  0101: TZ2  0110: TZ3  0111: EPWMxSYNCI  1000: DCEVTFILT  Others: Reserved" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM18_PCCTL" acronym="CONTROLSS_G3_EPWM18_PCCTL" offset="0x28" width="16" description="PWM Chopper Control Register">
		<bitfield id="CHPDUTY" width="3" begin="10" end="8" resetval="0x0" description="Chopping Clock Duty Cycle   000: Duty = 1/8 [12.5%]  001: Duty = 2/8 [25.0%]  010: Duty = 3/8 [37.5%]  011: Duty = 4/8 [50.0%]  100: Duty = 5/8 [62.5%]  101: Duty = 6/8 [75.0%]  110: Duty = 7/8 [87.5%]  111: Reserved" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="CHPFREQ" width="3" begin="7" end="5" resetval="0x0" description="Chopping Clock Frequency   000: Divide by 1 [no prescale, = 12.5 MHz at 100 MHz TBCLK]  001: Divide by 2 [6.25 MHz at 100 MHz TBCLK]  010: Divide by 3 [4.16 MHz at 100 MHz TBCLK]  011: Divide by 4 [3.12 MHz at 100 MHz TBCLK]  100: Divide by 5 [2.50 MHz at 100 MHz TBCLK]  101: Divide by 6 [2.08 MHz at 100 MHz TBCLK]  110: Divide by 7 [1.78 MHz at 100 MHz TBCLK]  111: Divide by 8 [1.56 MHz at 100 MHz TBCLK]" range="7 - 5" rwaccess="R/W"/> 
		<bitfield id="OSHTWTH" width="4" begin="4" end="1" resetval="0x0" description="One-Shot Pulse Width   0000: 1 x EPWMCLK / 8 wide [ = 80 ns at 100 MHz EPWMCLK]  0001: 2 x EPWMCLK / 8 wide [ = 160 ns at 100 MHz EPWMCLK]  0010: 3 x EPWMCLK / 8 wide [ = 240 ns at 100 MHz EPWMCLK]  0011: 4 x EPWMCLK / 8 wide [ = 320 ns at 100 MHz EPWMCLK]  0100: 5 x EPWMCLK / 8 wide [ = 400 ns at 100 MHz EPWMCLK]  0101: 6 x EPWMCLK / 8 wide [ = 480 ns at 100 MHz EPWMCLK]  0110: 7 x EPWMCLK / 8 wide [ = 560 ns at 100 MHz EPWMCLK]  0111: 8 x EPWMCLK / 8 wide [ = 640 ns at 100 MHz EPWMCLK]  1000: 9 x EPWMCLK / 8 wide [ = 720 ns at 100 MHz EPWMCLK]  1001: 10 x EPWMCLK / 8 wide [ = 800 ns at 100 MHz EPWMCLK]  1010: 11 x EPWMCLK / 8 wide [ = 880 ns at 100 MHz EPWMCLK]  1011: 12 x EPWMCLK / 8 wide [ = 960 ns at 100 MHz EPWMCLK]  1100: 13 x EPWMCLK / 8 wide [ = 1040 ns at 100 MHz EPWMCLK]  1101: 14 x EPWMCLK / 8 wide [ = 1120 ns at 100 MHz EPWMCLK]  1110: 15 x EPWMCLK / 8 wide [ = 1200 ns at 100 MHz EPWMCLK]  1111: 16 x EPWMCLK / 8 wide [ = 1280 ns at 100 MHz EPWMCLK]" range="4 - 1" rwaccess="R/W"/> 
		<bitfield id="CHPEN" width="1" begin="0" end="0" resetval="0x0" description="PWM-Chopping Enable   0: Disable [bypass] PWM chopping function  1: Enable chopping function" range="0" rwaccess="R/W"/>
	</register>
